Repository: qhta/DocxDocument
Catalog: ModelGenApp/CommonStrings.*.resx
Languages: pl

# ExcludedTypeTooltip
source: Excluded type is rejected even if its namespace is included.
pl: Typ wykluczony jest odrzucany, nawet gdy jego przestrzeń nazw jest akceptowalna.

# IncludedTypeTooltip
source: Included type is accepted even if its namespaces is excluded.
pl: Typ jest akceptowany, nawet gdy jego przestrzeń nazw jest wykluczona.

source: Meaningless description
pl: Opis bez znaczenia

source: Missing description
pl: Brak opisu

# MultiplicatedName
source: Owner namespace hase multiple types with the same name.
pl: Docelowa przestrzeń nazw zawiera wiele typów o tej samej nazwie.

source: Namespaces
pl: Przestrzenie nazw

source: No error
pl: Brak błędu

# Config
source: Configuration
pl: Konfiguracja

source: Types
pl: Typy

source: Properties
pl: Właściwości

# MainWindowTitle
source: Document model generator
pl: Generator modelu dokumentu

source: Cancel
pl: Anuluj

source: Type to scan
pl: Typ do skanowania

source: File with docs
pl: Plik z dokumentacją

source: Process phases:
pl: Fazy procesu:

source: Show results
pl: Pokaż wyniki

source: Save results
pl: Zapisz wyniki

source: Scan source
pl: Skanowanie źródła

source: Add docs
pl: Dodawanie opisów

source: Rename
pl: Zmiana nazw

# TypeToScanTooltip
source: This is the main type where scan begins. Its property types and item types are scanned next.
pl: To jest główny typ, od którego rozpoczyna się skanowanie. Następnie skanowane są typy jego właściwości i elementów.

# FileWithDocsTooltip
source: This is XML file with types and properties descriptions. It should be prepared by an external tool.
pl: To jest plik XML z opisami typów i właściwości. Powinien być przygotowany uprzednio za pomocą osobnego narzędzia.

# FileWithDocsUseTooltip
source: You can use or omit adding docs from file.
pl: Możesz użyć lub pominąć dodawanie opisów z pliku.

source: Model configuration
pl: Konfiguracja modelu

source: Original name
pl: Nazwa oryginalna

# OriginalNameTooltip
source: Original name is a name read from source.
pl: Nazwa oryginalna to nazwa odczytana ze źródła.

# ExcludedNamespaceTooltip
source: Excluded namespace is rejected from scanning.
pl: Wykluczona przestrzeń nazw zawiera typy wykluczone z przetwarzania.

source: Shortcut
pl: Skrót

# ShortcutTooltip
source: Shortcut replaces its name (if shortcuts are enabled).
pl: Skrót zastępuje nazwę (gdy jest to dozwolone).

source: Target name
pl: Nazwa docelowa

# TargetNameTooltip
source: Target name is a name written to output.
pl: Nazwa docelowa to nazwa zapisywana na wyjściu.

# TargetShortcutTooltip
source: Target shortcut replaces target name (if shortcuts are enabled).
pl: Skrót docelowy zastępuje nazwę docelową (gdy jest to dozwolone).

source: Target shortcut
pl: Skrót docelowy

source: Duplicated shortcut
pl: Zduplikowany skrót

# Target_shortcut_error
source: Target shortcuts must be different in different target names.
pl: Docelowe skróty nazw muszą być różne dla różnych nazw docelowych.

source: Save
pl: Zapisz

source: Model configuration saved in {0}
pl: Konfiguracja modelu zapisana w {0}

# Model_configuration_is_invalid
source: Model configuration is invalid. See marks in the table.
pl: Konfiguracja modelu jest nieprawidłowa. Zobacz znaczniki w tabeli.

source: Original namespace
pl: Oryginalna przestrzeń nazw

# OriginalNamespaceTooltip
source: Original namespace is a namespace read from source.
pl: Oryginalna przestrzeń nazw to przestrzeń nazw odczytana ze źródła.

# ExcludedNamespace
source: Excluded
pl: Czy wykluczona?

source: Included type
pl: Czy typ jest akceptowany?

source: Excluded type
pl: Czy typ wykluczony?

source: Target namespace
pl: Docelowa przestrzeń nazw

# TargetNamespaceTooltip
source: Target namespace is a namespace written to output.
pl: Docelowa przestrzeń nazw to przestrzeń nazw zapisywana na wyjściu.

source: Original declaration type
pl: Oryginalny typ deklaracji

# OriginalDeclarationTypeTooltip
source: Original declaration type is a type where a property is declared. If not defined then a property can be declared in any type.
pl: Oryginalny typ deklaracji to typ, w którym deklarowana jest właściwość. Jeśli nie jest zdefiniowany, to właściwość może być zadeklarowana w dowolnym typie.

source: Excluded property
pl: Wykl.wł.

# ExcludedPropertyTooltip
source: Excluded property is rejected even if its type is accepted.
pl: Właściwość wykluczona jest odrzucana, nawet gdy jej typ jest zaakceptowany.

source: Target property type
pl: Docelowy typ właściwości

# TargetPropertyTypeTooltip
source: Target property type is a type of property value written to output.
pl: Docelowy typ właściwości jest typem wartości właściwości zapisywanym na wyjściu.

source: Config property name
pl: Konfigurowana nazwa właściwości

# ConfigPropertyNameTooltip
source: Config property name is declared name of the property. Can contain * as a wildcard.
pl: Konfigurowana nazwa właściwości jest deklarowaną nazwą właściwości.

source: Name
pl: Nazwa

source: Result kind
pl: Rodzaj wyniku

source: Count
pl: Liczba

source: FIlter results
pl: Filtruj wyniki

source: Registered types
pl: Zarejestrowane typy

source: Accepted types
pl: Zaakceptowane typy

source: Rejected types
pl: Odrzucone typy

source: Namespace
pl: Przestrzeń nazw

source: All types
pl: Wszystkie typy

source: Classes
pl: Klasy

source: Enum types
pl: Typy wyliczane

source: Interfaces
pl: Interfejsy

source: Struct types
pl: Typy struktur

source: Other types
pl: Inne typy

source: Validation error
pl: Błąd weryfikacji

source: Shortcut error
pl: Błąd skrótu

source: Target shortcut error
pl: Błąd skrótu docelowego

source: Kind
pl: Rodzaj

source: Acceptance
pl: Akceptacja

source: Description
pl: Opis

source: Documentation
pl: Dokumentacja

# AcceptanceTooltip
source: Specifies whether the item was accepted or rejected at the end of the current phase.
pl: Określa, czy element został zaakceptowany (accepted), czy odrzucony (rejected) na koniec bieżącej fazy.

source: Type name
pl: Nazwa typu

source: Type full name
pl: Pełna nazwa typu

# TypeFullNameTooltip
source: Type name preceded with namespace.
pl: Pełna nazwa typu to nazwa typu poprzedzona przestrzenią nazw.

# DescriptionTooltip
source: Short description.
pl: Krótki opis.

source: All
pl: Wszystkie

source: Structs
pl: Struktury

source: Enums
pl: Wyliczenia

source: InterfaceTypes
pl: Typy interfejsowe

source: Others
pl: Inne

source: Class types
pl: Typy klas

source: Refresh
pl: Odśwież

source: Refresh results
pl: Odśwież wyniki

source: Declaring type
pl: Typ deklarujący

# DeclaringTypeTooltip
source: Declaring type is a type in which the property is declared. It can be the current type or one of its base types.
pl: Typ deklarujący to typ, w którym zadeklarowana jest właściwość. Może to być typ bieżący lub jeden z jego typów podstawowych.

source: Value type
pl: Typ wartości

# ValueTypeTooltip
source: Value type is declared type of property value.
pl: Typ wartości jest zadeklarowanym typem wartości właściwości.

source: Property name
pl: Nazwa właściwości

# PropertyNameTooltip
source: Property name is an original or target name of the property (depending on processing phase).
pl: Nazwa właściwości to oryginalna lub docelowa nazwa właściwości (w zależności od fazy przetwarzania).

# PropertiesTooltip
source: Properties define values assigned to the object of the class.
pl: Właściwości definiują wartości przypisane do obiektów danej klasy.

# EnumValName
source: Enum value name
pl: Nazwa wartości wyliczanej

# EnumValNameTooltip
source: Enum value name is an original or target name defined in the enum type (depending on processing phase).
pl: Nazwa wartości wyliczeniowej to nazwa oryginalna lub docelowa zdefiniowana w typie wyliczeniowym (w zależności od fazy przetwarzania).

source: Enum value
pl: Wartość wyliczana

# EnumValueTooltip
source: Enum value is a numeric value of the named value defined in the enum type.
pl: Wartość wyliczana to wartość liczbowa wartości nazwanej zdefiniowanej w typie wyliczeniowym.

# TypeNameTooltip
source: Type name is an original or target name of the type (depending on processing phase).
pl: Nazwa typu to oryginalna lub docelowa nazwa typu (w zależności od fazy przetwarzania).

source: Display options
pl: Opcje wyświetlania

source: AcceptedOnly
pl: Tylko zaakceptowane

source: Show declaring type
pl: Pokaż typ deklarujący

source: Display options:
pl: Opcje wyświetlania:

source: Show full type name
pl: Pokaż pełną nazwę typu

source: Validated types
pl: Typy zweryfikowane

source: Valid types
pl: Typy poprawne

source: Invalid types
pl: Typy niepoprawne

source: Types with description
pl: Typy z opisem

source: Types with added description
pl: Typy z dodanym opisem

source: Types without description
pl: Typy bez opisu

source: Types with non-unique name
pl: Typy o nieunikalnej nazwie

source: Renamed types
pl: Typy ze zmienioną nazwą

source: Converted types
pl: Typy przekonwertowane

source: Problematic types
pl: Typy problematyczne

source: Registered namespaces
pl: Zarejestrowane przestrzenie nazw

source: Checked types
pl: Sprawdzone typy

source: Types with meaningless description
pl: Typy z nieznaczącymi opisami

source: Types with same name
pl: Typy z tą samą nazwą

source: Show accepted only
pl: Pokaż tylko zaakceptowane

source: Members
pl: Składowe

source: Schema
pl: Schemat

source: Semantics
pl: Semantyka

source: Related type
pl: Typ powiązany

source: Relationships
pl: Relacje

source: Enum values
pl: Wartości wyliczane

source: Validate scan
pl: Weryfikuj skanowanie

source: Validate docs
pl: Weryfikuj opisy

source: Missing schema
pl: Brak schematu

# MissingIncludedTypeRels
source: Missing included types relationships
pl: Brak relacji do typów zawartości

# MissingIncludedTypeSchema
source: Missing included types in schema
pl: Brak typów zawartości na schemacie

# MissingSomeIncludedTypeSchema
source: Missing some included types in schema:
pl: Brak niektórych typów zawartości na schemacie:

# MissingSomeIncludedTypeRels
source: Missing some included types relationships:
pl: Brak niektórych relacji do typów zawartości:

source: Missing properties
pl: Brak właściwości

source: Validate names
pl: Weryfikuj nazwy

source: Enum vals
pl: Wartości

source: Validate conversion
pl: Weryfikuj konwersję

source: Convert types
pl: Konwertuj typy

source: Target type
pl: Typ docelowy

# TargetTypeTooltip
source: Target type results from conversion phase.
pl: Typ docelowy jest wynikiem fazy konwersji.

source: Base type
pl: Typ bazowy

source: Derived types
pl: Typy pochodne

source: Continue
pl: Kontynuuj

source: Show target namespaces
pl: Pokaż docelowe przestrzenie nazw

# CodeGen
source: Code generation
pl: Generowanie kodu

source: Validate generation
pl: Weryfikuj kod
